app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def current_user
    User.find(session[:current_user_id])

SELECT COUNT(*) FROM "users"
---
  def count_pages
    @pages = (User.count / PER_PAGE) + 1