app/controllers/pastes_controller.rb

INSERT INTO "pastes" ("user_id", "name", "content", "language", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["name", "qweqwe"], ["content", "qweqweasfksdfjjl;"], ["language", "plaintext"], ["created_at", "2022-12-23 12:17:36.760253"], ["updated_at", "2022-12-23 12:17:36.760253"]]
---
  def create
    @paste = Paste.new(paste_params)
    @paste.user = current_user
    respond_to do |format|
      if @paste.save

UPDATE "pastes" SET "name" = $1, "content" = $2, "updated_at" = $3 WHERE "pastes"."id" = $4  [["name", "цуйц"], ["content", "qweй"], ["updated_at", "2022-12-23 12:23:10.012930"], ["id", 2]]
---
  def update
    @flag = true
    respond_to do |format|
      if @paste.update(paste_params)

SELECT "pastes".* FROM "pastes" WHERE "pastes"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def set_paste
    @paste = Paste.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", ""], ["LIMIT", 1]]
---
  def find_user_id(username)
    nil unless username.presence
    User.find_by(username: username)&.id

SELECT "pastes".* FROM "pastes" WHERE "pastes"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 20], ["OFFSET", 0]]
SELECT "pastes".* FROM "pastes" LIMIT $1 OFFSET $2  [["LIMIT", 20], ["OFFSET", 0]]
---
  def search_query(query, page)
    if query.key?(:user_id) && !query[:user_id]
      []
    else
      [if query.any?
         Paste.where(query).limit(PER_PAGE).offset(PER_PAGE * page)
       else
         Paste.all.limit(PER_PAGE).offset(PER_PAGE * page)
       end].flatten.compact