app/controllers/sessions_controller.rb

  def create
    user_data = params[:user]
    user = User.find_by(username: user_data[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "admin"], ["LIMIT", 1]]