app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" LIMIT $1 OFFSET $2  [["LIMIT", 20], ["OFFSET", 0]]
---
  def search_query(query, page)
    [if query.any?
       User.where(query).limit(PER_PAGE).offset(PER_PAGE * page)
     else
       User.all.limit(PER_PAGE).offset(PER_PAGE * page)

UPDATE "users" SET "username" = $1, "email" = $2, "admin" = $3, "superuser" = $4 WHERE "users"."id" = $5  [["username", "user"], ["email", "user@mail"], ["admin", true], ["superuser", false], ["id", 2]]
---
  def update_user(submitted_user_params)
    if current_user&.admin && submitted_user_params[:password].blank?
      @user.update_columns(user_params.to_unsafe_h.except(:password))